#ifndef _SQLIST_H_ 
#define _SQLIST_H_
#include <stdio.h>
#include <stdlib.h>
#include <string.h>


#define INIT_SIZE 20		//初始线性表大小
#define INIT_INCREASE 10	//初始容量增长

typedef char ElemType;		//元素类型

//线性表结构
typedef struct 
{
	ElemType* elem;	//线性表
	int len;		//表元素个数
	int capacity;	//线性表容量
}SqList;


/*=======================================================
*	@函数功能：创建线性表
*	@函数参数：无
*	@函数返回：成功返回SqList*，失败返回NULL
*=======================================================*/
SqList* InitSqList();



/*=======================================================
*	@函数功能：线性表尾插入元素
*	@函数参数：SqList* , data
*	@函数返回：成功返回0，失败返回-1
*=======================================================*/
int InsertSqList(SqList* pList, ElemType data);



/*=======================================================
*	@函数功能：线性表头插入元素
*	@函数参数：SqList* , data
*	@函数返回：成功返回0，失败返回-1
*=======================================================*/
int HeadInsertToSqList(SqList* pList, ElemType data);



/*=======================================================
*	@函数功能：指定位置插入线性表
*	@函数参数：SqList* , pos , data
*	@函数返回：成功返回0，位置不合法返回-2，失败返回-1
*=======================================================*/
int PosInsertToSqList(SqList* pList,int pos,ElemType data);



/*=======================================================
*	@函数功能：线性表尾删除元素
*	@函数参数：SqList* 
*	@函数返回：成功返回0，失败返回-1
*=======================================================*/
int DeleteSqList(SqList* pList);



/*=======================================================
*	@函数功能：线性表头删除元素
*	@函数参数：SqList*
*	@函数返回：成功返回0，失败返回-1
*=======================================================*/
int HeadDeleteToSqList(SqList* pList);



/*=======================================================
*	@函数功能：指定位置删除线性表
*	@函数参数：SqList* , pos
*	@函数返回：成功返回0，位置不合法返回-2，失败返回-1
*=======================================================*/
int PosDeleteToSqList(SqList* pList,int pos);



/*=======================================================
*	@函数功能：获取线性表指定位置值
*	@函数参数：SqList* , pos
*	@函数返回：成功返回该值，位置不合法返回-2，失败返回-1
*=======================================================*/
int GetPosValueSqList(SqList* pList, int pos);



/*=======================================================
*	@函数功能：获取线性表长度
*	@函数参数：SqList*
*	@函数返回：成功返回线性表长度，失败返回-1
*=======================================================*/
int GetSqListLen(SqList* pList);



/*=======================================================
*	@函数功能：清空线性表
*	@函数参数：SqList*
*	@函数返回：成功返回0，失败返回-1
*=======================================================*/
int ClearSqList(SqList* pList);



/*=======================================================
*	@函数功能：释放线性表空间
*	@函数参数：SqList**
*	@函数返回：成功返回0，失败返回-1
*=======================================================*/
int FreeSqList(SqList* pList);



/*=======================================================
*	@函数功能：遍历线性表
*	@函数参数：SqList*
*	@函数返回：成功返回0，失败返回-1
*=======================================================*/
int PrintSqList(SqList* pList);

#endif
